In [1]:
import pandas as pd
import numpy as np

# Pandas
`Pandas` is a library built on top of `NumPy` for analyzing data in (Excel, CSV, JSON, etc.)

<p dir='rtl'>
مكتبة <code>Pandas</code> هى مكتبه مبنيه على <code>NumPy</code> لتحليل بيانات (Excel, CSV, JSON, etc.)
</p>

## Series

`Series` is like `1D array` but with a label
<p dir='rtl'>
<code>Series</code> مثل <code>1D Array</code> ولكن تحتوى على اسم
</p>

In [2]:
series = pd.Series(["Ali", "noor", "nader"], name="names")
series

0      Ali
1     noor
2    nader
Name: names, dtype: str

### loc
`loc` is a shortcut of `location` for getting data by there index
<p dir='rtl'>
<code>loc</code> هو اختصار لكلمة <code>location</code> للوصول الى البيانات عن طريق index
</p>

In [3]:
series.loc[0]

'Ali'

In [4]:
series.loc[:1]

0     Ali
1    noor
Name: names, dtype: str

### Create your own indexs

In [5]:
series_with_index = pd.Series([20,30,22,60], dtype='int8', index=['ali', 'ahmed', 'noor', 'james'])
# OR
series_with_index = pd.Series(
    {
        "ali": 20,
        "ahmed": 30,
        "noor": 22,
        "james": 60
    },
    dtype='int8'
)

series_with_index

ali      20
ahmed    30
noor     22
james    60
dtype: int8

In [6]:
series_with_index.loc['ahmed']

np.int8(30)

In [7]:
series_with_index.loc['ahmed':'james']

ahmed    30
noor     22
james    60
dtype: int8

### iloc
`iloc` is the same of `loc` but it referes to `integer location` to access data by it's integer index
<p dir='rtl'>
<code>iloc</code> يعتبر مثل <code>loc</code> ولكن تسمى <code>integer location</code> للوصول الى البيانات عن طريق index الرقمى
</p>

In [8]:
series_with_index.iloc[0]

np.int8(20)

In [9]:
series_with_index.iloc[:2]

ali      20
ahmed    30
dtype: int8

## DataFrame

`DataFrame` is like a `2D Array` but with a label and the data is displayed like Excel
<p dir='rtl'>
<code>DataFrame</code> مثل <code>2D Array</code> ولكن لديها اسم ويتم عرضها مثل Excel
</p>

In [27]:
df = pd.DataFrame(
    {
        "name": ['ahmed', 'ali', 'james', 'mohamed', 'nada', 'nader'],
        "age": np.array([31, 36, 22, 23, 44, 34], dtype=np.int8),
    }
)
df

      name  age
0    ahmed   31
1      ali   36
2    james   22
3  mohamed   23
4     nada   44
5    nader   34

### info

In [11]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      str
 1   age     6 non-null      int8
dtypes: int8(1), str(1)
memory usage: 186.0 bytes

### describe

In [12]:
df.describe()

             age
count   6.000000
mean   31.666667
std     8.310636
min    22.000000
25%    25.000000
50%    32.500000
75%    35.500000
max    44.000000

### Accessing Data By Column Name

In [13]:
df['name']

0      ahmed
1        ali
2      james
3    mohamed
4       nada
5      nader
Name: name, dtype: str

### Accessing Data By Location

In [14]:
df.loc[0]

name    ahmed
age        31
Name: 0, dtype: object

### Adding a Column

In [33]:
df['job'] = ["enginner", "Teacher", "Student", "Pilot", "Cashier", "Driver"]
df

      name  age       job
0    ahmed   31  enginner
1      ali   36   Teacher
2    james   22   Student
3  mohamed   23     Pilot
4     nada   44   Cashier
5    nader   34    Driver

### Adding Rows

In [16]:
users = pd.DataFrame(
    [
        {"name": 'samy', "age": 21, "job": "manager"},
        {"name": 'jana', "age": 25, "job": "designer"},
    ], 
    index=[6, 7]
)
df = pd.concat([df, users])
df

      name  age       job
0    ahmed   31  enginner
1      ali   36   Teacher
2    james   22   Student
3  mohamed   23     Pilot
4     nada   44   Cashier
5    nader   34    Driver
6     samy   21   manager
7     jana   25  designer

### getting the last index

In [17]:
df.last_valid_index()

7

## Filtering DataFrame

In [18]:
df

      name  age       job
0    ahmed   31  enginner
1      ali   36   Teacher
2    james   22   Student
3  mohamed   23     Pilot
4     nada   44   Cashier
5    nader   34    Driver
6     samy   21   manager
7     jana   25  designer

In [36]:
df.loc[df['age'] > 30]

    name  age       job
0  ahmed   31  enginner
1    ali   36   Teacher
4   nada   44   Cashier
5  nader   34    Driver

In [38]:
df.loc[df['age'] > 30, ['name', 'job']]

    name       job
0  ahmed  enginner
1    ali   Teacher
4   nada   Cashier
5  nader    Driver